# Base Packages

brew 'ack'                                     # Grep for source code.
brew 'ag'                                      # The Silver Searcher. Faster ack.
brew 'archey'                                  # "About this Mac" CLI.
brew 'aria2'                                   # Multi-protocol download client.
brew 'bat'                                     # A cat clone with wings.
brew 'cloc'                                    # Count lines of code in a directory.
brew 'cmatrix'                                 # Matrix in the terminal.
brew 'coreutils'                               # GNU core utilities (Mac is BSD).
brew 'cowsay'                                  # Configurable talking characters in ASCII art.
brew 'curl'                                    # HTTP client.
brew 'direnv'                                  # Shell environment switcher.
brew 'doctl'                                   # DigitalOcean CLI
brew 'duti'                                    # A command-line tool to select default applications for document types and URL schemes on Mac OS X
brew 'exiftool'                                # Image exif manipulation.
brew 'fd'                                      # A simple, fast, and user-friendly alternative to 'find'.
brew 'fdupes'                                  # Duplicate file finder.
brew 'ffmpeg'                                  # Play, record, convert, and stream audio and video.
brew 'figlet'                                  # Make large letters out of ordinary text.
brew 'findutils'                               # Install GNU `find`, `locate`, `updatedb`, and `xargs`, `g`-prefixed.
brew 'fzf'                                     # Fuzzy finder.
brew 'git'                                     # Distributed revision control system.
brew 'git-cal'                                 # Visual commits calendar for git.
brew 'git-delta'                               # A syntax-highlighter for git and diff output
brew 'git-extras'                              # Extra git commands.
brew 'git-imerge'                              # Incremental merge helper for git.
brew 'git-lfs'                                 # Git extension for versioning large files.
brew 'git-open'                                # Open the GitHub page or website for the current repository.
brew 'gnu-sed', args: ['with-default-names']   # GNU version of the sed utility.
brew 'gnu-tar', args: ['with-default-names']   # GNU version of the tar utility.
brew 'gnu-which', args: ['with-default-names'] # GNU version of the tar utility.
brew 'gnupg'                                   # GNU Pretty Good Privacy (PGP) package.
brew 'graphviz'                                # Rich set of graph drawing tools.
brew 'gron'                                    # Make JSON greppable!
brew 'httpie'                                  # cURL-like tool for humans.
brew 'imagemagick'                             # CLI image manipulation utilities.
brew 'jq'                                      # SED for JSON.
brew 'jpegoptim'                               # Optimize/compress JPEG files without losing quality.
brew 'make', args: ['with-default-names']      # GNU make utility to maintain groups of programs.
brew 'mas'                                     # Mac App Store CLI
brew 'mitmproxy'                               # Intercept, modify, replay, save HTTP/S traffic.
brew 'moreutils'                               # Other useful utilities.
brew 'mpg123'                                  # MP3 player for Linux and UNIX.
brew 'mycli'                                   # MySQL CLI with autocomplete and syntax highlighting.
brew 'neofetch'                                # A command-line system information tool written in bash 3.2+
brew 'neovim'                                  # Neovim
brew 'netcat'                                  # Utility for managing network connections.
brew 'ngrep'                                   # Network grep.
brew 'nmap'                                    # Network exploration tool and security / port scanner.
brew 'node'                                    # Node.js.
brew 'nyancat'                                 # Nyancat in your terminal, rendered through ANSI escape sequences.
brew 'p7zip'                                   # A command line port of the 7zip utility to Unix, Mac OS X and BeOS.
brew 'pgcli'                                   # PostgreSQL CLI with autocomplete and syntax highlighting.
brew 'pigz'                                    # Parallel Implementation of GZip
brew 'pv'                                      # Monitor the progress of data through a pipe.
brew 'python3'                                 # Python 3
brew 'ranger'                                  # File browser.
brew 'reattach-to-user-namespace'              # Utility for tighter macOS and tmux integration
brew 'rename'                                  # File renaming utilities.
brew 'rbenv'                                   # Groom your app’s Ruby environment
brew 'rig'                                     # Random Identity Generator
brew 'ripgrep'                                 # Faster Silver Searcher.
brew 'rsync'                                   # Utility that provides fast incremental file transfer
brew 'ruby-build'                              # Compile and install Ruby
brew 'siege'                                   # HTTP regression testing and benchmarking utility
brew 'sift'                                    # Fast and powerful alternative to grep.
brew 'sl'                                      # Steam Locomotive
brew 'ssh-copy-id'                             # Add a public key to a remote machine's authorized_keys file.
brew 'sshuttle'                                # Proxy server that works as a poor man's VPN.
brew 'starship'                                # The minimal, blazing-fast, and infinitely customizable prompt for any shell!
brew 'tig'                                     # Text-mode interface for git.
brew 'tmux'                                    # Terminal multiplexer.
brew 'toilet'                                  # Display large, colorful characters.
brew 'tree'                                    # Display directories as trees (with optional color/HTML output).
brew 'vbindiff'                                # Visual binary diff.
brew 'vim'                                     # Vi "workalike" with many additional features.
brew 'wabt'                                    # The WebAssembly Binary Toolkit (pronounced wabbit).
brew 'watchman'                                # Watches files and records, or triggers actions, when they change.
brew 'wget'                                    # Internet file retriever.
brew 'woof'                                    # Simple one-off HTTP file sharing.
brew 'wrk'                                     # HTTP load tester.
brew 'yarn'                                    # JavaScript package manager.
brew 'zsh'                                     # UNIX shell (command interpreter).

# Casks
cask '1password'                 # Password manager.
cask 'alacritty'                 # A cross-platform, GPU-accelerated terminal emulator. The fastest terminal emulator in existence.
cask 'alfred'                    # Power-user spotlight.
cask 'appcleaner'                # Mac app uninstaller.
cask 'apptrap'                   # Automatically uninstall apps when moving them to the trash.
cask 'atom'                      # Open source hackable text editor from GitHub.
cask 'beardedspice'              # More control over keyboard media keys.
cask 'bettertouchtool'           # Advanced system touch gesture control.
cask 'firefox'                   # Web browser from Mozilla.
cask 'google-chrome'             # Web browser from Google.
cask 'google-backup-and-sync'    # Google Drive
cask 'keka'                      # Archive extraction and creation.
cask 'keybase'                   # Crypto for everyone.
cask 'kitty'                     # the fast, featureful, GPU based terminal emulator¶
cask 'tableplus'                 # Modern, native, and friendly GUI tool for relational databases: MySQL, PostgreSQL, SQLite & more.
cask 'paw'                       # The most advanced API tool for Mac
cask 'vimr'                      # neovim gui
cask 'virtualbox'                # Open source virtual machines.
cask 'virtualbox-extension-pack' # Extensions for Virtual Box.
cask 'visual-studio-code'        # Electron-based text editor from Microsoft.
cask 'vlc'                       # Open source media player.

# Cask Quick Look Plugins
cask 'betterzip'           # Quicklook for zip files.
cask 'provisionql'         # Quicklook for ipa & provision.
cask 'qlcolorcode'         # Quicklook syntax highlighting.
cask 'qlimagesize'         # Adds dimensions and file size to Quicklook title bar.
cask 'qlmarkdown'          # Quicklook for markdown.
cask 'qlprettypatch'       # Quicklook for patch files.
cask 'qlstephen'           # Quicklook for extensionless text files (README, etc).
cask 'quicklook-csv'       # Quicklook for csv files.
cask 'quicklook-json'      # Quicklook for json files.
cask 'suspicious-package'  # Quicklook for package files.
cask 'webpquicklook'       # Quicklook for webp files.

# Cask Fonts
tap 'homebrew/cask-fonts' # official caskroom fonts tap
cask 'font-dosis'
cask 'font-fira-sans'
cask 'font-fontawesome'
cask 'font-inconsolata'
cask 'font-lato'
cask 'font-league-gothic'
cask 'font-montserrat'
cask 'font-muli'
cask 'font-open-sans'
cask 'font-pacifico'
cask 'font-pt-sans'
cask 'font-quicksand'
cask 'font-raleway'
cask 'font-roboto'
cask 'font-roboto-condensed'
cask 'font-sauce-code-pro-nerd-font'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'

# Alternative cask versions
tap 'homebrew/homebrew-cask-versions'
cask 'google-chrome-canary'

# Mac App Store
mas 'Amphetamine', id: 937984704
